#### LayerModifier Members

---

|  |
| --- |
| LayerModifier Class   Constructors   Methods   Properties   See Also |

The  LayerModifier  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | LayerModifier | Constructs a new LayerModifier with default values. |
| Public method | LayerModifier(ModifierType, String) | Constructs a new LayerModifier with modifierType and separator. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LayerModifier |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ModifierType | The modifier type of LayerModifier. |
| Public property | Separator | The separator string that will follow this modifier in the export layer name. |

# See Also

LayerModifier Class

Autodesk.Revit.DB Namespace